Revit 2026 API
RebarContainerItem.SetFromCurvesAndShape Method
Overload List
Name | Description
SetFromCurvesAndShape(RebarShape, RebarBarType, RebarHookType, RebarHookType, XYZ, IList<Curve>, RebarHookOrientation, RebarHookOrientation) | Obsolete.
SetFromCurvesAndShape(RebarShape, RebarBarType, RebarHookType, RebarHookType, XYZ, IList<Curve>, RebarTerminationOrientation, RebarTerminationOrientation)
Top
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace